#### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Terraform Plan</summary>

```hcl
  # module.ai_search.azurerm_subnet.srch_snet will be created
  + resource "azurerm_subnet" "srch_snet" {
      + address_prefixes                               = [
          + "10.20.4.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-svc-srch-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"
    }

  # module.ai_search.module.srch_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.20.4.0/26",
        ] -> null
      - default_outbound_access_enabled                = true -> null
      - enforce_private_link_endpoint_network_policies = true -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-srch-snet-01" -> null
      - name                                           = "io-p-itn-svc-srch-snet-01" -> null
      - private_endpoint_network_policies              = "Disabled" -> null
      - private_endpoint_network_policies_enabled      = false -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "io-p-itn-common-rg-01" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "io-p-itn-common-vnet-01" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>
